//==========================================================================================================================================
//===================================================================== ГЛАВА 1 ===========================================================

//№1 Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.
/* let num = +prompt("Введите число: ");
if(num < 0){
    console.log("Отрицательное число " + num);  
}else if(num > 0){
    console.log("Положительное число " + num);  
}else{
    console.log("Ваше число 0");  
} */


//№2 Дана строка. Выведите в консоль длину этой строки.
/* let string = "Привет!";
console.log(string.length); */

//№3 Дана строка. Выведите в консоль последний символ строки.
/* let string = "Привет!";
console.log(string.charAt(string.length - 1));
console.log(string.at(- 1)); */

//№4 Дано число. Проверьте, четное оно или нет.
/* let n = +prompt("Введите число: ");
if(n % 2 == 0){
    console.log("Число " + n + " четное");
}else{
    console.log("Число " + n + " нечетное");
} */

//№5 Даны два слова. Проверьте, что первые буквы этих слов совпадают.
/* let a = "Hello";
let b = "Hi";
if(a.at(0).toLowerCase() == b.at(0).toLowerCase()){
    console.log("Первые буквы одинаковые");
}else{
    console.log("Первые буквы разные");
} */

//№6 Дано слово. Проверьте, совпадает ли его первая буква с последней.
/* let word = "Hello";
let m = word.at(0).toLowerCase() === word.at(-1).toLowerCase() ? console.log("Одинаковые") : console.log("Разные"); */

//============================================================================================================================================
//======================================================================= ГЛАВА 2 ============================================================

//№1 Дано число. Выведите в консоль первую цифру этого числа.
/* let num = prompt("Введите число: ");
let a = num[0];
console.log(a); */

//№2 Дано число. Выведите в консоль последнюю цифру этого числа.
/* let num = prompt("Введите число: ");
console.log(num[num.length - 1]); */

//№3 Дано число. Выведите в консоль сумму первой и последней цифры этого числа.
/* let num = prompt("Введите число: ");
console.log(Number(num.at(0)) + Number(num.at(num.length - 1))); */

//№4 Дано число. Выведите количество цифр в этом числе.
/* let num = prompt("Введите число: ");
console.log(num.length); */

//№5 Даны два числа. Проверьте, что первые цифры этих чисел совпадают.
/* let a = prompt("Введите первое число: ");
let b = prompt("Введите второе число: ");

if(a.at(0) == "-"){
    a = String(a * -1); //будет числовое значение
}

if(b.at(0) == "-"){
    b = String(b * -1); //будет числовое значение
}

if(a.at(0) == b.at(0)){
    console.log("Первые цифры одинаковые");
}else{
    console.log("Первые цифры не одинаковые");
} */

//==========================================================================================================================================
//============================================================ ГЛАВА 3 ====================================================================

